In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
#Postgresql preparations

In [4]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [5]:
taxi=pd.read_csv('~/Downloads/taxi+_zone_lookup.csv')

In [6]:
green=pd.read_csv("~/Downloads/green_tripdata_2019-01.csv")

In [7]:
taxi.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [8]:
green.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,3.0,0.5,0.5,0.00,0.0,NaN,0.3,4.30,2,1,NaN
1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,6.0,0.5,0.5,0.00,0.0,NaN,0.3,7.30,2,1,NaN
2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,4.5,0.5,0.5,0.00,0.0,NaN,0.3,5.80,1,1,NaN
3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,13.5,0.5,0.5,2.96,0.0,NaN,0.3,19.71,1,1,NaN
4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,18.0,0.5,0.5,0.00,0.0,NaN,0.3,19.30,2,1,NaN

In [10]:
#create table

In [15]:
taxi.head(0).to_sql('y_taxi', engine, if_exists='replace', index=False)

0

In [23]:
green.head(0).to_sql('g_taxi', engine, if_exists='replace', index=False)

0

In [16]:
#insert

In [17]:
taxi.to_sql('y_taxi', engine, if_exists='append', index=False)

265

In [24]:
green.to_sql('g_taxi', engine, if_exists='append', index=False)

918

In [19]:
%load_ext sql

In [20]:
%sql $engine.url

In [22]:
%sql SELECT * from y_taxi limit 5

 * postgresql://root:***@localhost:5432/ny_taxi
5 rows affected.

[(1, 'EWR', 'Newark Airport', 'EWR'),
 (2, 'Queens', 'Jamaica Bay', 'Boro Zone'),
 (3, 'Bronx', 'Allerton/Pelham Gardens', 'Boro Zone'),
 (4, 'Manhattan', 'Alphabet City', 'Yellow Zone'),
 (5, 'Staten Island', 'Arden Heights', 'Boro Zone')]

In [26]:
%sql SELECT * from g_taxi limit 5

 * postgresql://root:***@localhost:5432/ny_taxi
5 rows affected.

[(2, '2018-12-21 15:17:29', '2018-12-21 15:18:57', 'N', 1, 264, 264, 5, 0.0, 3.0, 0.5, 0.5, 0.0, 0.0, None, 0.3, 4.3, 2, 1, None),
 (2, '2019-01-01 00:10:16', '2019-01-01 00:16:32', 'N', 1, 97, 49, 2, 0.86, 6.0, 0.5, 0.5, 0.0, 0.0, None, 0.3, 7.3, 2, 1, None),
 (2, '2019-01-01 00:27:11', '2019-01-01 00:31:38', 'N', 1, 49, 189, 2, 0.66, 4.5, 0.5, 0.5, 0.0, 0.0, None, 0.3, 5.8, 1, 1, None),
 (2, '2019-01-01 00:46:20', '2019-01-01 01:04:54', 'N', 1, 189, 17, 2, 2.68, 13.5, 0.5, 0.5, 2.96, 0.0, None, 0.3, 19.71, 1, 1, None),
 (2, '2019-01-01 00:19:06', '2019-01-01 00:39:43', 'N', 1, 82, 258, 1, 4.53, 18.0, 0.5, 0.5, 0.0, 0.0, None, 0.3, 19.3, 2, 1, None)]

Question 3. 
How many taxi trips were totally made on January 15?

Tip: started and finished on 2019-01-15.

Remember that lpep_pickup_datetime and lpep_dropoff_datetime columns are in the format timestamp (date and hour+min+sec) and not in date.

In [29]:
%sql SELECT count(*) from g_taxi where Date(lpep_pickup_datetime)='2019-01-15' and Date(lpep_dropoff_datetime)='2019-01-15'

 * postgresql://root:***@localhost:5432/ny_taxi
1 rows affected.

[(20530,)]

Question 4.
Which was the day with the largest trip distance Use the pick up time for your calculations.

In [34]:
%sql SELECT Date(lpep_pickup_datetime),trip_distance from g_taxi order by trip_distance desc limit 1

 * postgresql://root:***@localhost:5432/ny_taxi
1 rows affected.

[(datetime.date(2019, 1, 15), 117.99)]

Question 5.
In 2019-01-01 how many trips had 2 and 3 passengers?

In [32]:
%sql SELECT count(*) from g_taxi where Date(lpep_pickup_datetime)='2019-01-01' and passenger_count=2

 * postgresql://root:***@localhost:5432/ny_taxi
1 rows affected.

[(1282,)]

In [33]:
%sql SELECT count(*) from g_taxi where Date(lpep_pickup_datetime)='2019-01-01' and passenger_count=3

 * postgresql://root:***@localhost:5432/ny_taxi
1 rows affected.

[(254,)]

Question 6.
For the passengers picked up in the Astoria Zone which was the drop off zone that had the largest tip? We want the name of the zone, not the id.

Note: it's not a typo, it's tip , not trip

In [63]:
%sql with cte as (SELECT "DOLocationID" from g_taxi join y_taxi on y_taxi."LocationID"=g_taxi."PULocationID" where "Zone"='Astoria' order by tip_amount desc limit 1) select "Zone" from cte join y_taxi on y_taxi."LocationID"=cte."DOLocationID"

 * postgresql://root:***@localhost:5432/ny_taxi
1 rows affected.

[('Long Island City/Queens Plaza',)]